STMicroelectronics/x-cube-azrtos-h7rs/Drivers/CMSIS/Device/ST/STM32H7RSxx/Include/stm32h7rsxxxxx.h
/*******************  Bit definition for DCMIPP_PRESCR register  **************/
#define DCMIPP_PRESCR_FSC_Pos          (0U)
#define DCMIPP_PRESCR_FSC_Msk          (0xFFUL << DCMIPP_PRESCR_FSC_Pos)       /*!< 0x000000FF */
#define DCMIPP_PRESCR_FSC              DCMIPP_PRESCR_FSC_Msk                   /*!< Frame start delimiter code */
#define DCMIPP_PRESCR_LSC_Pos          (8U)
#define DCMIPP_PRESCR_LSC_Msk          (0xFFUL << DCMIPP_PRESCR_LSC_Pos)       /*!< 0x0000FF00 */
#define DCMIPP_PRESCR_LSC              DCMIPP_PRESCR_LSC_Msk                   /*!< Line start delimiter code */
#define DCMIPP_PRESCR_LEC_Pos          (16U)
#define DCMIPP_PRESCR_LEC_Msk          (0xFFUL << DCMIPP_PRESCR_LEC_Pos)       /*!< 0x00FF0000 */
#define DCMIPP_PRESCR_LEC              DCMIPP_PRESCR_LEC_Msk                   /*!< Line end delimiter code */
#define DCMIPP_PRESCR_FEC_Pos          (24U)
#define DCMIPP_PRESCR_FEC_Msk          (0xFFUL << DCMIPP_PRESCR_FEC_Pos)       /*!< 0xFF000000 */
#define DCMIPP_PRESCR_FEC              DCMIPP_PRESCR_FEC_Msk                   /*!< Frame end delimiter code */

/*******************  Bit definition for DCMIPP_PRESUR register  **************/
#define DCMIPP_PRESUR_FSU_Pos          (0U)
#define DCMIPP_PRESUR_FSU_Msk          (0xFFUL << DCMIPP_PRESUR_FSU_Pos)       /*!< 0x000000FF */
#define DCMIPP_PRESUR_FSU              DCMIPP_PRESUR_FSU_Msk                   /*!< Frame start delimiter unmask */
#define DCMIPP_PRESUR_LSU_Pos          (8U)
#define DCMIPP_PRESUR_LSU_Msk          (0xFFUL << DCMIPP_PRESUR_LSU_Pos)       /*!< 0x0000FF00 */
#define DCMIPP_PRESUR_LSU              DCMIPP_PRESUR_LSU_Msk                   /*!< Line start delimiter unmask */
#define DCMIPP_PRESUR_LEU_Pos          (16U)
#define DCMIPP_PRESUR_LEU_Msk          (0xFFUL << DCMIPP_PRESUR_LEU_Pos)       /*!< 0x00FF0000 */
#define DCMIPP_PRESUR_LEU              DCMIPP_PRESUR_LEU_Msk                   /*!< Line end delimiter unmask */
#define DCMIPP_PRESUR_FEU_Pos          (24U)
#define DCMIPP_PRESUR_FEU_Msk          (0xFFUL << DCMIPP_PRESUR_FEU_Pos)       /*!< 0xFF000000 */
#define DCMIPP_PRESUR_FEU              DCMIPP_PRESUR_FEU_Msk                   /*!< Frame end delimiter unmask */

/*******************  Bit definition for DCMIPP_PRIER register  ***************/
#define DCMIPP_PRIER_ERRIE_Pos         (6U)
#define DCMIPP_PRIER_ERRIE_Msk         (0x1UL << DCMIPP_PRIER_ERRIE_Pos)       /*!< 0x00000040 */
#define DCMIPP_PRIER_ERRIE             DCMIPP_PRIER_ERRIE_Msk                  /*!< Synchronization error interrupt enable */

/*******************  Bit definition for DCMIPP_PRSR register  ****************/
#define DCMIPP_PRSR_ERRF_Pos           (6U)
#define DCMIPP_PRSR_ERRF_Msk           (0x1UL << DCMIPP_PRSR_ERRF_Pos)         /*!< 0x00000040 */
#define DCMIPP_PRSR_ERRF               DCMIPP_PRSR_ERRF_Msk                    /*!< Synchronization error raw interrupt status */
#define DCMIPP_PRSR_HSYNC_Pos          (16U)
#define DCMIPP_PRSR_HSYNC_Msk          (0x1UL << DCMIPP_PRSR_HSYNC_Pos)        /*!< 0x00010000 */
#define DCMIPP_PRSR_HSYNC              DCMIPP_PRSR_HSYNC_Msk                   /*!< HSYNC */
#define DCMIPP_PRSR_VSYNC_Pos          (17U)
#define DCMIPP_PRSR_VSYNC_Msk          (0x1UL << DCMIPP_PRSR_VSYNC_Pos)        /*!< 0x00020000 */
#define DCMIPP_PRSR_VSYNC              DCMIPP_PRSR_VSYNC_Msk                   /*!< VSYNC */

/*******************  Bit definition for DCMIPP_PRFCR register  ***************/
#define DCMIPP_PRFCR_CERRF_Pos         (6U)
#define DCMIPP_PRFCR_CERRF_Msk         (0x1UL << DCMIPP_PRFCR_CERRF_Pos)       /*!< 0x00000040 */
#define DCMIPP_PRFCR_CERRF             DCMIPP_PRFCR_CERRF_Msk                  /*!< Synchronization error interrupt status clear */

/*******************  Bit definition for DCMIPP_CMCR register  ****************/
#define DCMIPP_CMCR_CFC_Pos            (4U)
#define DCMIPP_CMCR_CFC_Msk            (0x1UL << DCMIPP_CMCR_CFC_Pos)          /*!< 0x00000010 */
#define DCMIPP_CMCR_CFC                DCMIPP_CMCR_CFC_Msk                     /*!< Clear frame counter */

/*******************  Bit definition for DCMIPP_CMFRCR register  **************/
#define DCMIPP_CMFRCR_FRMCNT_Pos       (0U)
#define DCMIPP_CMFRCR_FRMCNT_Msk       (0xFFFFFFFFUL << DCMIPP_CMFRCR_FRMCNT_Pos) /*!< 0xFFFFFFFF */
#define DCMIPP_CMFRCR_FRMCNT           DCMIPP_CMFRCR_FRMCNT_Msk                   /*!< FRMCNT[31:0]: frame counter */

/*******************  Bit definition for DCMIPP_CMIER register  ***************/
#define DCMIPP_CMIER_ATXERRIE_Pos      (5U)
#define DCMIPP_CMIER_ATXERRIE_Msk      (0x1UL << DCMIPP_CMIER_ATXERRIE_Pos)    /*!< 0x00000020 */
#define DCMIPP_CMIER_ATXERRIE          DCMIPP_CMIER_ATXERRIE_Msk               /*!< AXI Transfer error interrupt enable for IP_Plug */
#define DCMIPP_CMIER_PRERRIE_Pos       (6U)
#define DCMIPP_CMIER_PRERRIE_Msk       (0x1UL << DCMIPP_CMIER_PRERRIE_Pos)     /*!< 0x00000040 */
#define DCMIPP_CMIER_PRERRIE           DCMIPP_CMIER_PRERRIE_Msk                /*!< limit interrupt enable for the Parallel Interface */
#define DCMIPP_CMIER_P0LINEIE_Pos      (8U)
#define DCMIPP_CMIER_P0LINEIE_Msk      (0x1UL << DCMIPP_CMIER_P0LINEIE_Pos)    /*!< 0x0000100 */
#define DCMIPP_CMIER_P0LINEIE          DCMIPP_CMIER_P0LINEIE_Msk               /*!< multi-Line Capture complete interrupt enable for the Pipe0 */
#define DCMIPP_CMIER_P0FRAMEIE_Pos     (9U)
#define DCMIPP_CMIER_P0FRAMEIE_Msk     (0x1UL << DCMIPP_CMIER_P0FRAMEIE_Pos)   /*!< 0x0000200 */
#define DCMIPP_CMIER_P0FRAMEIE         DCMIPP_CMIER_P0FRAMEIE_Msk              /*!< Frame Capture complete interrupt enable for the Pipe0 */
#define DCMIPP_CMIER_P0VSYNCIE_Pos     (10U)
#define DCMIPP_CMIER_P0VSYNCIE_Msk     (0x1UL << DCMIPP_CMIER_P0VSYNCIE_Pos)   /*!< 0x0000400 */
#define DCMIPP_CMIER_P0VSYNCIE         DCMIPP_CMIER_P0VSYNCIE_Msk              /*!< Vertical sync interrupt enable for the Pipe0 */
#define DCMIPP_CMIER_P0LIMITIE_Pos     (14U)
#define DCMIPP_CMIER_P0LIMITIE_Msk     (0x1UL << DCMIPP_CMIER_P0LIMITIE_Pos)   /*!< 0x0004000 */
#define DCMIPP_CMIER_P0LIMITIE         DCMIPP_CMIER_P0LIMITIE_Msk              /*!< limit interrupt enable for the Pipe0 */
#define DCMIPP_CMIER_P0OVRIE_Pos       (15U)
#define DCMIPP_CMIER_P0OVRIE_Msk       (0x1UL << DCMIPP_CMIER_P0OVRIE_Pos)     /*!< 0x0008000 */
#define DCMIPP_CMIER_P0OVRIE           DCMIPP_CMIER_P0OVRIE_Msk                /*!< Overrun interrupt enable for the Pipe0 */

