STMicroelectronics/x-cube-azrtos-h7rs/Drivers/CMSIS/Device/ST/STM32H7RSxx/Include/stm32h7rsxxxxx.h
#if defined(STM32H7S7xx) || defined(STM32H7S3xx)
/******************************************************************************/
/*                                                                            */
/*                       Memory Cipher Engine (MCE)                           */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for MCE_CR register  ********************/
#define MCE_CR_GLOCK_Pos               (0U)
#define MCE_CR_GLOCK_Msk               (0x1UL << MCE_CR_GLOCK_Pos)             /*!< 0x00000001 */
#define MCE_CR_GLOCK                   MCE_CR_GLOCK_Msk                        /*!< MCE global lock */
#define MCE_CR_MKLOCK_Pos              (1U)
#define MCE_CR_MKLOCK_Msk              (0x1UL << MCE_CR_MKLOCK_Pos)            /*!< 0x00000002 */
#define MCE_CR_MKLOCK                  MCE_CR_MKLOCK_Msk                       /*!< MCE master and fast master keys lock */

/********************  Bit definition for MCE_SR register  ********************/
#define MCE_SR_MKVALID_Pos             (0U)
#define MCE_SR_MKVALID_Msk             (0x1UL << MCE_SR_MKVALID_Pos)           /*!< 0x00000001 */
#define MCE_SR_MKVALID                 MCE_SR_MKVALID_Msk                      /*!< MCE master key valid flag */
#define MCE_SR_FMKVALID_Pos            (2U)
#define MCE_SR_FMKVALID_Msk            (0x1UL << MCE_SR_FMKVALID_Pos)          /*!< 0x00000004 */
#define MCE_SR_FMKVALID                 MCE_SR_FMKVALID_Msk                    /*!< MCE fast master key valid flag */
#define MCE_SR_ENCDIS_Pos              (4U)
#define MCE_SR_ENCDIS_Msk              (0x1UL << MCE_SR_ENCDIS_Pos)            /*!< 0x00000010 */
#define MCE_SR_ENCDIS                  MCE_SR_ENCDIS_Msk                       /*!< MCE encryption disabled flag */

/********************  Bit definition for MCE_IASR register  ******************/
#define MCE_IASR_CAEF_Pos              (0U)
#define MCE_IASR_CAEF_Msk              (0x1UL << MCE_IASR_CAEF_Pos)             /*!< 0x00000001 */
#define MCE_IASR_CAEF                  MCE_IASR_CAEF_Msk                        /*!< MCE configuration access error flag */
#define MCE_IASR_IAEF_Pos              (1U)
#define MCE_IASR_IAEF_Msk              (0x1UL << MCE_IASR_IAEF_Pos)             /*!< 0x00000002 */
#define MCE_IASR_IAEF                  MCE_IASR_IAEF_Msk                        /*!< MCE illegal access error flag */

/********************  Bit definition for MCE_IACR register  ******************/
#define MCE_IACR_CAEF_Pos              (0U)
#define MCE_IACR_CAEF_Msk              (0x1UL << MCE_IACR_CAEF_Pos)             /*!< 0x00000001 */
#define MCE_IACR_CAEF                  MCE_IACR_CAEF_Msk                        /*!< MCE configuration access error clear bit */
#define MCE_IACR_IAEF_Pos              (1U)
#define MCE_IACR_IAEF_Msk              (0x1UL << MCE_IACR_IAEF_Pos)             /*!< 0x00000002 */
#define MCE_IACR_IAEF                  MCE_IACR_IAEF_Msk                        /*!< MCE illegal access error clear bit */

/********************  Bit definition for MCE_IAIER register  *****************/
#define MCE_IAIER_CAEIE_Pos            (0U)
#define MCE_IAIER_CAEIE_Msk            (0x1UL << MCE_IAIER_CAEIE_Pos)           /*!< 0x00000001 */
#define MCE_IAIER_CAEIE                MCE_IAIER_CAEIE_Msk                      /*!< MCE configuration access error interrupt enable */
#define MCE_IAIER_IAEIE_Pos            (1U)
#define MCE_IAIER_IAEIE_Msk            (0x1UL << MCE_IAIER_IAEIE_Pos)           /*!< 0x00000002 */
#define MCE_IAIER_IAEIE                MCE_IAIER_IAEIE_Msk                      /*!< MCE illegal access error interrupt enable */

/********************  Bit definition for MCE_PRIVCFGR register  **************/
#define MCE_PRIVCFGR_PRIV_Pos          (0U)
#define MCE_PRIVCFGR_PRIV_Msk          (0x1UL << MCE_PRIVCFGR_PRIV_Pos)         /*!< 0x00000001 */
#define MCE_PRIVCFGR_PRIV              MCE_PRIVCFGR_PRIV_Msk                    /*!< MCE privileged configuration */

/********************  Bit definition for MCE_IAESR register  *****************/
#define MCE_IAESR_IAPRIV_Pos           (4U)
#define MCE_IAESR_IAPRIV_Msk           (0x1UL << MCE_IAESR_IAPRIV_Pos)          /*!< 0x00000010 */
#define MCE_IAESR_IAPRIV               MCE_IAESR_IAPRIV_Msk                     /*!< MCE illegal access privilege */
#define MCE_IAESR_IANRW_Pos            (7U)
#define MCE_IAESR_IANRW_Msk            (0x1UL << MCE_IAESR_IANRW_Pos)           /*!< 0x00000080 */
#define MCE_IAESR_IANRW                MCE_IAESR_IANRW_Msk                      /*!< MCE illegal access read/write */

/********************  Bit definition for MCE_IADDR register  *****************/
#define MCE_IADDR_IADD_Pos             (0U)
#define MCE_IADDR_IADD_Msk             (0xFFFFFFFFUL << MCE_IADDR_IADD_Pos)     /*!< 0xFFFFFFFF */
#define MCE_IADDR_IADD                 MCE_IADDR_IADD_Msk                       /*!< MCE illegal address */

/********************  Bit definition for MCE_REGCR register  *****************/
#define MCE_REGCR_BREN_Pos             (0U)
#define MCE_REGCR_BREN_Msk             (0x1UL << MCE_REGCR_BREN_Pos)            /*!< 0x00000001 */
#define MCE_REGCR_BREN                 MCE_REGCR_BREN_Msk                       /*!< MCE base region enable */
#define MCE_REGCR_CTXID_Pos            (9U)
#define MCE_REGCR_CTXID_Msk            (0x3UL << MCE_REGCR_CTXID_Pos)           /*!< 0x00000600 */
#define MCE_REGCR_CTXID                MCE_REGCR_CTXID_Msk                      /*!< MCE context ID */
#define MCE_REGCR_CTXID_0              (0x1UL << MCE_REGCR_CTXID_Pos)           /*!< 0x00000200 */
#define MCE_REGCR_CTXID_1              (0x2UL << MCE_REGCR_CTXID_Pos)           /*!< 0x00000400 */
#define MCE_REGCR_ENC_Pos              (14U)
#define MCE_REGCR_ENC_Msk              (0x3UL << MCE_REGCR_ENC_Pos)             /*!< 0x0000C000 */
#define MCE_REGCR_ENC                  MCE_REGCR_ENC_Msk                        /*!< MCE encrypted region */
#define MCE_REGCR_ENC_0                (0x1UL << MCE_REGCR_ENC_Pos)             /*!< 0x00004000 */
#define MCE_REGCR_ENC_1                (0x2UL << MCE_REGCR_ENC_Pos)             /*!< 0x00008000 */
#define MCE_REGCR_PRIV_Pos             (16U)
#define MCE_REGCR_PRIV_Msk             (0x1UL << MCE_REGCR_PRIV_Pos)            /*!< 0x00010000 */
#define MCE_REGCR_PRIV                 MCE_REGCR_PRIV_Msk                       /*!< MCE privileged region */

