STMicroelectronics/x-cube-azrtos-h7rs/Drivers/CMSIS/Device/ST/STM32H7RSxx/Include/stm32h7rsxxxxx.h
/********************  Bit definition for RCC_PLL1DIVR1 register  *************/
#define RCC_PLL1DIVR1_DIVN_Pos        (0U)
#define RCC_PLL1DIVR1_DIVN_Msk        (0x1FFUL << RCC_PLL1DIVR1_DIVN_Pos)    /*!< 0x000001FF */
#define RCC_PLL1DIVR1_DIVN            RCC_PLL1DIVR1_DIVN_Msk                 /*!< DIVN1[8:0] bits: PLL1 DIVN division factor */
#define RCC_PLL1DIVR1_DIVN_0          (0x001UL << RCC_PLL1DIVR1_DIVN_Pos)    /*!< 0x00000001 */
#define RCC_PLL1DIVR1_DIVN_1          (0x002UL << RCC_PLL1DIVR1_DIVN_Pos)    /*!< 0x00000002 */
#define RCC_PLL1DIVR1_DIVN_2          (0x004UL << RCC_PLL1DIVR1_DIVN_Pos)    /*!< 0x00000004 */
#define RCC_PLL1DIVR1_DIVN_3          (0x008UL << RCC_PLL1DIVR1_DIVN_Pos)    /*!< 0x00000008 */
#define RCC_PLL1DIVR1_DIVN_4          (0x010UL << RCC_PLL1DIVR1_DIVN_Pos)    /*!< 0x00000010 */
#define RCC_PLL1DIVR1_DIVN_5          (0x020UL << RCC_PLL1DIVR1_DIVN_Pos)    /*!< 0x00000020 */
#define RCC_PLL1DIVR1_DIVN_6          (0x040UL << RCC_PLL1DIVR1_DIVN_Pos)    /*!< 0x00000040 */
#define RCC_PLL1DIVR1_DIVN_7          (0x080UL << RCC_PLL1DIVR1_DIVN_Pos)    /*!< 0x00000080 */
#define RCC_PLL1DIVR1_DIVN_8          (0x100UL << RCC_PLL1DIVR1_DIVN_Pos)    /*!< 0x00000100 */

#define RCC_PLL1DIVR1_DIVP_Pos        (9U)
#define RCC_PLL1DIVR1_DIVP_Msk        (0x7FUL << RCC_PLL1DIVR1_DIVP_Pos)     /*!< 0x0000FE00 */
#define RCC_PLL1DIVR1_DIVP            RCC_PLL1DIVR1_DIVP_Msk                 /*!< DIVP1[6:0] bits: PLL1 DIVP division factor */
#define RCC_PLL1DIVR1_DIVP_0          (0x001UL << RCC_PLL1DIVR1_DIVP_Pos)    /*!< 0x00000200 */
#define RCC_PLL1DIVR1_DIVP_1          (0x002UL << RCC_PLL1DIVR1_DIVP_Pos)    /*!< 0x00000400 */
#define RCC_PLL1DIVR1_DIVP_2          (0x004UL << RCC_PLL1DIVR1_DIVP_Pos)    /*!< 0x00000800 */
#define RCC_PLL1DIVR1_DIVP_3          (0x008UL << RCC_PLL1DIVR1_DIVP_Pos)    /*!< 0x00001000 */
#define RCC_PLL1DIVR1_DIVP_4          (0x010UL << RCC_PLL1DIVR1_DIVP_Pos)    /*!< 0x00002000 */
#define RCC_PLL1DIVR1_DIVP_5          (0x020UL << RCC_PLL1DIVR1_DIVP_Pos)    /*!< 0x00004000 */
#define RCC_PLL1DIVR1_DIVP_6          (0x040UL << RCC_PLL1DIVR1_DIVP_Pos)    /*!< 0x00008000 */

#define RCC_PLL1DIVR1_DIVQ_Pos        (16U)
#define RCC_PLL1DIVR1_DIVQ_Msk        (0x7FUL << RCC_PLL1DIVR1_DIVQ_Pos)     /*!< 0x007F0000 */
#define RCC_PLL1DIVR1_DIVQ            RCC_PLL1DIVR1_DIVQ_Msk                 /*!< DIVQ1[6:0] bits: PLL1 DIVQ division factor */
#define RCC_PLL1DIVR1_DIVQ_0          (0x001UL << RCC_PLL1DIVR1_DIVQ_Pos)    /*!< 0x00010000 */
#define RCC_PLL1DIVR1_DIVQ_1          (0x002UL << RCC_PLL1DIVR1_DIVQ_Pos)    /*!< 0x00020000 */
#define RCC_PLL1DIVR1_DIVQ_2          (0x004UL << RCC_PLL1DIVR1_DIVQ_Pos)    /*!< 0x00040000 */
#define RCC_PLL1DIVR1_DIVQ_3          (0x008UL << RCC_PLL1DIVR1_DIVQ_Pos)    /*!< 0x00080000 */
#define RCC_PLL1DIVR1_DIVQ_4          (0x010UL << RCC_PLL1DIVR1_DIVQ_Pos)    /*!< 0x00100000 */
#define RCC_PLL1DIVR1_DIVQ_5          (0x020UL << RCC_PLL1DIVR1_DIVQ_Pos)    /*!< 0x00200000 */
#define RCC_PLL1DIVR1_DIVQ_6          (0x040UL << RCC_PLL1DIVR1_DIVQ_Pos)    /*!< 0x00400000 */

#define RCC_PLL1DIVR1_DIVR_Pos        (24U)
#define RCC_PLL1DIVR1_DIVR_Msk        (0x7FUL << RCC_PLL1DIVR1_DIVR_Pos)     /*!< 0x7F000000 */
#define RCC_PLL1DIVR1_DIVR            RCC_PLL1DIVR1_DIVR_Msk                 /*!< DIVR1[6:0] bits: PLL1 DIVR division factor */
#define RCC_PLL1DIVR1_DIVR_0          (0x001UL << RCC_PLL1DIVR1_DIVR_Pos)    /*!< 0x01000000 */
#define RCC_PLL1DIVR1_DIVR_1          (0x002UL << RCC_PLL1DIVR1_DIVR_Pos)    /*!< 0x02000000 */
#define RCC_PLL1DIVR1_DIVR_2          (0x004UL << RCC_PLL1DIVR1_DIVR_Pos)    /*!< 0x04000000 */
#define RCC_PLL1DIVR1_DIVR_3          (0x008UL << RCC_PLL1DIVR1_DIVR_Pos)    /*!< 0x08000000 */
#define RCC_PLL1DIVR1_DIVR_4          (0x010UL << RCC_PLL1DIVR1_DIVR_Pos)    /*!< 0x10000000 */
#define RCC_PLL1DIVR1_DIVR_5          (0x020UL << RCC_PLL1DIVR1_DIVR_Pos)    /*!< 0x20000000 */
#define RCC_PLL1DIVR1_DIVR_6          (0x040UL << RCC_PLL1DIVR1_DIVR_Pos)    /*!< 0x40000000 */

/********************  Bit definition for RCC_PLL1FRACR register  *************/
#define RCC_PLL1FRACR_FRACN_Pos        (3U)
#define RCC_PLL1FRACR_FRACN_Msk        (0x1FFFUL << RCC_PLL1FRACR_FRACN_Pos) /*!< 0x0000FFF8 */
#define RCC_PLL1FRACR_FRACN            RCC_PLL1FRACR_FRACN_Msk               /*!< FRACN[12:0] bits */

/********************  Bit definition for RCC_PLL2DIVR1 register  *************/
#define RCC_PLL2DIVR1_DIVN_Pos        (0U)
#define RCC_PLL2DIVR1_DIVN_Msk        (0x1FFUL << RCC_PLL2DIVR1_DIVN_Pos)    /*!< 0x000001FF */
#define RCC_PLL2DIVR1_DIVN            RCC_PLL2DIVR1_DIVN_Msk                 /*!< DIVN2[8:0] bits: PLL2 DIVN division factor */
#define RCC_PLL2DIVR1_DIVN_0          (0x001UL << RCC_PLL2DIVR1_DIVN_Pos)    /*!< 0x00000001 */
#define RCC_PLL2DIVR1_DIVN_1          (0x002UL << RCC_PLL2DIVR1_DIVN_Pos)    /*!< 0x00000002 */
#define RCC_PLL2DIVR1_DIVN_2          (0x004UL << RCC_PLL2DIVR1_DIVN_Pos)    /*!< 0x00000004 */
#define RCC_PLL2DIVR1_DIVN_3          (0x008UL << RCC_PLL2DIVR1_DIVN_Pos)    /*!< 0x00000008 */
#define RCC_PLL2DIVR1_DIVN_4          (0x010UL << RCC_PLL2DIVR1_DIVN_Pos)    /*!< 0x00000010 */
#define RCC_PLL2DIVR1_DIVN_5          (0x020UL << RCC_PLL2DIVR1_DIVN_Pos)    /*!< 0x00000020 */
#define RCC_PLL2DIVR1_DIVN_6          (0x040UL << RCC_PLL2DIVR1_DIVN_Pos)    /*!< 0x00000040 */
#define RCC_PLL2DIVR1_DIVN_7          (0x080UL << RCC_PLL2DIVR1_DIVN_Pos)    /*!< 0x00000080 */
#define RCC_PLL2DIVR1_DIVN_8          (0x100UL << RCC_PLL2DIVR1_DIVN_Pos)    /*!< 0x00000100 */

#define RCC_PLL2DIVR1_DIVP_Pos        (9U)
#define RCC_PLL2DIVR1_DIVP_Msk        (0x7FUL << RCC_PLL2DIVR1_DIVP_Pos)     /*!< 0x0000FE00 */
#define RCC_PLL2DIVR1_DIVP            RCC_PLL2DIVR1_DIVP_Msk                 /*!< DIVP2[6:0] bits: PLL2 DIVP division factor */
#define RCC_PLL2DIVR1_DIVP_0          (0x001UL << RCC_PLL2DIVR1_DIVP_Pos)    /*!< 0x00000200 */
#define RCC_PLL2DIVR1_DIVP_1          (0x002UL << RCC_PLL2DIVR1_DIVP_Pos)    /*!< 0x00000400 */
#define RCC_PLL2DIVR1_DIVP_2          (0x004UL << RCC_PLL2DIVR1_DIVP_Pos)    /*!< 0x00000800 */
#define RCC_PLL2DIVR1_DIVP_3          (0x008UL << RCC_PLL2DIVR1_DIVP_Pos)    /*!< 0x00001000 */
#define RCC_PLL2DIVR1_DIVP_4          (0x010UL << RCC_PLL2DIVR1_DIVP_Pos)    /*!< 0x00002000 */
#define RCC_PLL2DIVR1_DIVP_5          (0x020UL << RCC_PLL2DIVR1_DIVP_Pos)    /*!< 0x00004000 */
#define RCC_PLL2DIVR1_DIVP_6          (0x040UL << RCC_PLL2DIVR1_DIVP_Pos)    /*!< 0x00008000 */

#define RCC_PLL2DIVR1_DIVQ_Pos        (16U)
#define RCC_PLL2DIVR1_DIVQ_Msk        (0x7FUL << RCC_PLL2DIVR1_DIVQ_Pos)     /*!< 0x007F0000 */
#define RCC_PLL2DIVR1_DIVQ            RCC_PLL2DIVR1_DIVQ_Msk                 /*!< DIVQ2[6:0] bits: PLL2 DIVQ division factor */
#define RCC_PLL2DIVR1_DIVQ_0          (0x001UL << RCC_PLL2DIVR1_DIVQ_Pos)    /*!< 0x00010000 */
#define RCC_PLL2DIVR1_DIVQ_1          (0x002UL << RCC_PLL2DIVR1_DIVQ_Pos)    /*!< 0x00020000 */
#define RCC_PLL2DIVR1_DIVQ_2          (0x004UL << RCC_PLL2DIVR1_DIVQ_Pos)    /*!< 0x00040000 */
#define RCC_PLL2DIVR1_DIVQ_3          (0x008UL << RCC_PLL2DIVR1_DIVQ_Pos)    /*!< 0x00080000 */
#define RCC_PLL2DIVR1_DIVQ_4          (0x010UL << RCC_PLL2DIVR1_DIVQ_Pos)    /*!< 0x00100000 */
#define RCC_PLL2DIVR1_DIVQ_5          (0x020UL << RCC_PLL2DIVR1_DIVQ_Pos)    /*!< 0x00200000 */
#define RCC_PLL2DIVR1_DIVQ_6          (0x040UL << RCC_PLL2DIVR1_DIVQ_Pos)    /*!< 0x00400000 */

